app/Controllers/News.php

    public function create()
    {
        helper('form'); //Memanggil helper form

        $data = $this->request->getPost(['title', 'body']); // mengambil data dari form

        // mengecek atau memvalidasi
        if (! $this->validateData($data, [
            'title' => 'required|max_length[255]|min_length[3]',
            'body'  => 'required|max_length[5000]|min_length[10]',
        ])) {
            // JIka validasi gagal akan kembali ke form.
            return $this->new();
        }

        // Mengambil data yang telah tervalidasi
        $post = $this->validator->getValidated();

        $model = model(NewsModel::class);

        //menyimpan ke db
        $model->save([
            'title' => $post['title'],
            'slug'  => url_title($post['title'], '-', true),
            'body'  => $post['body'],
        ]);
---
INSERT INTO `news` (`title`, `slug`, `body`) VALUES ('Yey berhasil', 'yey-berhasil', 'Berhasil bikin')